In [1]:
import numpy as np
import pandas as pd

The following return true if there is a missing value; any of them can be used apparently

In [2]:
pd.isnull(None)

True

In [3]:
pd.isnull(np.nan)

True

In [4]:
pd.isna(None)

True

In [5]:
pd.isna(np.nan)

True

The following do tthe opposite

In [6]:
pd.notnull(None)

False

In [7]:
pd.notna(3)

True

In [8]:
ser=pd.Series([1,2,3,np.nan,np.nan,4])

In [9]:
ser.isnull()

0    False
1    False
2    False
3     True
4     True
5    False
dtype: bool

In [10]:
pd.notnull(ser)

0     True
1     True
2     True
3    False
4    False
5     True
dtype: bool

In [11]:
ser.dropna()

0    1.0
1    2.0
2    3.0
5    4.0
dtype: float64

In [12]:
df=pd.DataFrame({
    'Column A':[1,2,np.nan,4,np.nan],
    'Column B':[np.nan,np.nan,3,4,5],
    'Column C':[np.nan,1,np.nan,3,np.nan],
    'Column D':[np.nan,np.nan,np.nan,0,np.nan]
})

In [13]:
df

   Column A  Column B  Column C  Column D
0       1.0       NaN       NaN       NaN
1       2.0       NaN       1.0       NaN
2       NaN       3.0       NaN       NaN
3       4.0       4.0       3.0       0.0
4       NaN       5.0       NaN       NaN

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Column A  3 non-null      float64
 1   Column B  3 non-null      float64
 2   Column C  2 non-null      float64
 3   Column D  1 non-null      float64
dtypes: float64(4)
memory usage: 292.0 bytes

In [15]:
df.isnull().sum()

Column A    2
Column B    2
Column C    3
Column D    4
dtype: int64

In [16]:
df.fillna(df.mean())

   Column A  Column B  Column C  Column D
0  1.000000       4.0       2.0       0.0
1  2.000000       4.0       1.0       0.0
2  2.333333       3.0       2.0       0.0
3  4.000000       4.0       3.0       0.0
4  2.333333       5.0       2.0       0.0

In [17]:
df

   Column A  Column B  Column C  Column D
0       1.0       NaN       NaN       NaN
1       2.0       NaN       1.0       NaN
2       NaN       3.0       NaN       NaN
3       4.0       4.0       3.0       0.0
4       NaN       5.0       NaN       NaN

Now we move onto cleaning notnull data, the initial stuff we did was for null

In [18]:
df2=pd.DataFrame({
    'Sex':['M','M','F','M','F','D','N'],
    'Age':[23,330,30,19,24,200,28]
})

In [19]:
df2

  Sex  Age
0   M   23
1   M  330
2   F   30
3   M   19
4   F   24
5   D  200
6   N   28

In [20]:
df2['Sex'].unique()

array(['M', 'F', 'D', 'N'], dtype=object)

In [21]:
df2['Sex'].replace({'N':'M','D':'F'})

0    M
1    M
2    F
3    M
4    F
5    F
6    M
Name: Sex, dtype: object

In [22]:
df2[df2['Age']>100]

  Sex  Age
1   M  330
5   D  200

In [23]:
df2.loc[df2['Age']>100, 'Age']= df2.loc[df2['Age']>100,'Age']/10

In [24]:
df2

  Sex  Age
0   M   23
1   M   33
2   F   30
3   M   19
4   F   24
5   D   20
6   N   28